packetqc/AI/STM32N6/AI_TO_NPU_1/run-23/FSBL/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "extmem_manager.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
// #include "stm32n6570_discovery_xspi.h"
// #include "stm32n6570_discovery_errno.h"
#include "stm32n6570_discovery.h"    /* BSP: COM1 VCP UART + LEDs (board-canonical) */
#include "stai_network.h"            /* STAI API + the TCN NPU model (Neural-ART HW) */
#include "network_tokens.h"          /* device tokenizer support (rule prompts + decode) */
#include "npu_query.h"               /* grammar-oracle bridge (autoregressive NPU recall) */
#include "grammar_runner.h"          /* parse + evaluate via the oracle (the calculator) */
// #include "stm32n6xx_hal_bsec.h"
// #include "stm32n6xx_hal_ramcfg.h"
// #include "llm_fsbl.h"
// #include "llm_test_fsbl.h"
// #include "npu_init.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

CACHEAXI_HandleTypeDef hcacheaxi;

RAMCFG_HandleTypeDef hramcfg_SRAM1;
RAMCFG_HandleTypeDef hramcfg_SRAM2;
RAMCFG_HandleTypeDef hramcfg_SRAM3;
RAMCFG_HandleTypeDef hramcfg_SRAM4;
RAMCFG_HandleTypeDef hramcfg_SRAM5;
RAMCFG_HandleTypeDef hramcfg_SRAM6;

UART_HandleTypeDef huart1;

XSPI_HandleTypeDef hxspi1;
XSPI_HandleTypeDef hxspi2;

/* USER CODE BEGIN PV */
COM_InitTypeDef BspCOMInit;

volatile int debugFlag = 0;  /* 1 = spin in catch loop for MCP GDB attach + release (methodology). */
volatile uint32_t g_boot_stage = 0;  /* init progress marker — read via GDB to localize a stall/error */

/* NPU model (TCN, STAI). Opaque context buffer — sized by the generated header, 8-aligned. */
__attribute__((aligned(STAI_NETWORK_CONTEXT_ALIGNMENT)))
static uint8_t s_network_ctx[STAI_NETWORK_CONTEXT_SIZE];
static stai_network *g_network = NULL;
/* The Neural-ART HW network bakes its activations in its memory pool (ACTIVATIONS_NUM=0) —
 * no app-provided activation buffer needed. */
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_XSPI1_Init(void);
static void MX_XSPI2_Init(void);
static void MX_BSEC_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_RAMCFG_Init(void);
static void MX_ICACHE_Init(void);
static void MX_CACHEAXI_Init(void);
static void SystemIsolation_Config(void);
/* USER CODE BEGIN PFP */
static void Enable_NPU_RAM_ForCore(void);
static void Enable_AXICACHE_RAM_ForCore(void);
static void OpenDebug(void);
extern void TerminalLogger_SmokeTest(void);  /* C++ TerminalLogger (terminal_logger.cpp), extern "C" */
extern void Cpp_STL_SmokeTest(void);         /* C++ STL infra test (cpp_runtime.cpp), extern "C" */
extern void NPU_SetVerbose(int on);          /* per-token NPU dialog toggle (grammar_runner.cpp) */
// void LLM_Repl_Run(void);   /* interactive NPU grammar REPL (llm_repl.cpp) */
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
/* Direct-register USART1 TX — HAL_UART_Transmit fails silently in the FSBL boot context
 * (HAL_GetTick may not advance), per reference N6_EDGEAI_1. Poll ISR.TXFNF (bit 7), write TDR. */
// static void uart1_putc(char c)
// {
//     while ((USART1->ISR & (1u << 7)) == 0) { __NOP(); }
//     USART1->TDR = (uint32_t)(uint8_t)c;
// }
// static void uart_puts(const char *s)
// {
//     if (USART1->CR1 == 0U) return;   /* UART not initialised yet */
//     for (; *s; ++s) uart1_putc(*s);
// }

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */
  /* RAM-bank power-on for the M55 core — BEFORE any code touches AXISRAM3-6 / CACHEAXIRAM
   * (boot ROM parks them; first access faults). Ref project N6_EDGEAI_1 main(). */
  Enable_NPU_RAM_ForCore();
  Enable_AXICACHE_RAM_ForCore();

  /* Re-authorize Secure SWD core debug (runtime BSEC, no OTP) so the MCP GDB session can
   * attach to the running FSBL. Ref N6_EDGEAI_1. REMOVE for production. */
  OpenDebug();

  /* GDB catch loop (debugFlag technique — methodology-debug-fsbl-direct + ref N6_EDGEAI_1):
   * CPU spins here after OpenDebug. MCP flow: gdb_server_start(attach) -> connect -> CPU is
   * in this loop -> release via write M[&debugFlag]=0 + DCIMVAC + resume -> step. */
  while (debugFlag) { __NOP(); }

  /* Force-disable MPU first: BootROM/leftover FSBL state may leave XN regions that fault
   * instruction fetch in our load range. Ref N6_EDGEAI_1. */
  HAL_MPU_Disable();

  /* Suppress the BootROM "unsigned-boot" RED LED (LD2 = PG10, active-low): under SWD
   * load_and_run the ROM drives PG10 LOW (LED ON) as a debug signal; a BSRR set-bit flips
   * it HIGH (OFF). Ref N6_EDGEAI_1. */
  __HAL_RCC_GPIOG_CLK_ENABLE();
  GPIOG->BSRR = (1U << 10);

  /* Clear stale pending IRQs the boot ROM / prior boot leave — they re-fire right after
   * load_and_run and fault into uninitialised HAL state. Ref N6_EDGEAI_1. */
  HAL_NVIC_DisableIRQ(TIM2_IRQn);
  HAL_NVIC_ClearPendingIRQ(TIM2_IRQn);
  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/
  HAL_Init();

