packetqc/AI/STM32N6/AI_TO_NPU_1/run-23/FSBL/Core/Src/main.c
  /* NPU MODEL */
  {
    /* Initialize the TCN model context (STAI). Inputs/outputs/weights are preallocated
     * in network.c / network_data.c and placed by the custom linker. */
    g_network = (stai_network *)s_network_ctx;
    stai_return_code rc = stai_network_init(g_network);
    if (rc != STAI_SUCCESS)
    {
      printf("NPU model init FAILED (stai rc=%d) - boot_stage=%lu\r\n",
             (int)rc, (unsigned long)g_boot_stage);
      Error_Handler();
    }
    g_boot_stage = 9;
    printf("NPU HW model init OK (ctx=%u B, weights @0x34064000)\r\n",
           (unsigned)STAI_NETWORK_CONTEXT_SIZE);
  }

  /* NPU INFERENCE — boot self-test: prove the Neural-ART path end-to-end on-device. */
  {
    stai_ptr in_buf = NULL, out_buf = NULL;
    stai_size n_in = 0, n_out = 0;
    stai_network_get_inputs(g_network, &in_buf, &n_in);
    stai_network_get_outputs(g_network, &out_buf, &n_out);
    if (in_buf == NULL || out_buf == NULL)
    {
      printf("NPU get in/out FAILED\r\n");
      Error_Handler();
    }

    g_boot_stage = 10;
    {
      const char *expr = "3 + 4";
      int ok = 0;
      long res = Grammar_Calc(g_network, (int8_t *)in_buf, (const int8_t *)out_buf, expr, &ok);
      if (ok) printf("\r\nNPU self-test: %s = %ld\r\n", expr, res);
      else    printf("\r\nNPU self-test: %s -> parse failed\r\n", expr);
    }
  }

  /* Autonomous on-chip calculator over the ST-Link VCP (USART1 / huart1). The device does
   * ALL the work — this proves edge autonomy. The host unified runner in `--mode device` is a
   * thin terminal: it pushes an expression and collects the result; the tokenize, parse, evaluate
   * and NPU grammar recall all run HERE on the Cortex-M55 + Neural-ART. Connect directly with
   *   minicom -D /dev/ttyACM0 -b 115200
   * or via the runner (scripts/classes/class_model_runner.py --mode device). */
  {
    stai_ptr rin = NULL, rout = NULL; stai_size rn = 0;
    stai_network_get_inputs(g_network, &rin, &rn);
    stai_network_get_outputs(g_network, &rout, &rn);
    NPU_SetVerbose(0);   /* concise: per-rule [model #N] dialog, no per-token spam */

    printf("\r\n=== NPU calculator (autonomous) — type an expression, Enter to evaluate ===\r\n");
    for (;;)
    {
      char line[64];
      int  n = 0;
      printf("calc> ");
      for (;;)   /* read one line from the VCP, with echo + backspace */
      {
        uint8_t ch;
        if (HAL_UART_Receive(&huart1, &ch, 1, HAL_MAX_DELAY) != HAL_OK) continue;
        if (ch == '\r' || ch == '\n') break;
        if (ch == 0x08 || ch == 0x7F) { if (n > 0) { --n; printf("\b \b"); } continue; }
        if (n < (int)sizeof(line) - 1) { line[n++] = (char)ch; HAL_UART_Transmit(&huart1, &ch, 1, 100); }
      }
      line[n] = '\0';
      printf("\r\n");
      if (n == 0) continue;

      /* device parses + evaluates + drives its own NPU — fully on-chip */
      int  ok  = 0;
      long res = Grammar_Calc(g_network, (int8_t *)rin, (const int8_t *)rout, line, &ok);
      if (ok) printf("= %ld\r\n", res);
      else    printf("parse failed for \"%s\"\r\n", line);
    }
  }
  /* USER CODE END 2 */

  /* Launch the application */
  if (BOOT_OK != BOOT_Application())
  {
    Error_Handler();
  }
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}
/* USER CODE BEGIN CLK 1 */
/* USER CODE END CLK 1 */

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the System Power Supply
  */
  if (HAL_PWREx_ConfigSupply(PWR_EXTERNAL_SOURCE_SUPPLY) != HAL_OK)
  {
    Error_Handler();
  }

  /** Configure the main internal regulator output voltage
  */
  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE0) != HAL_OK)
  {
    Error_Handler();
  }

  /* Enable HSI */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSIDiv = RCC_HSI_DIV1;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_NONE;
  RCC_OscInitStruct.PLL4.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Get current CPU/System buses clocks configuration and if necessary switch
 to intermediate HSI clock to ensure target clock can be set
  */
  HAL_RCC_GetClockConfig(&RCC_ClkInitStruct);
  if ((RCC_ClkInitStruct.CPUCLKSource == RCC_CPUCLKSOURCE_IC1) ||
     (RCC_ClkInitStruct.SYSCLKSource == RCC_SYSCLKSOURCE_IC2_IC6_IC11))
  {
    RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_CPUCLK | RCC_CLOCKTYPE_SYSCLK);
    RCC_ClkInitStruct.CPUCLKSource = RCC_CPUCLKSOURCE_HSI;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct) != HAL_OK)
    {
      /* Initialization Error */
      Error_Handler();
    }
  }

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_NONE;
  RCC_OscInitStruct.PLL1.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL1.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL1.PLLM = 2;
  RCC_OscInitStruct.PLL1.PLLN = 75;
  RCC_OscInitStruct.PLL1.PLLFractional = 0;
  RCC_OscInitStruct.PLL1.PLLP1 = 1;
  RCC_OscInitStruct.PLL1.PLLP2 = 1;
  RCC_OscInitStruct.PLL2.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL2.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL2.PLLM = 8;
  RCC_OscInitStruct.PLL2.PLLN = 125;
  RCC_OscInitStruct.PLL2.PLLFractional = 0;
  RCC_OscInitStruct.PLL2.PLLP1 = 1;
  RCC_OscInitStruct.PLL2.PLLP2 = 1;
  RCC_OscInitStruct.PLL3.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL3.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL3.PLLM = 8;
  RCC_OscInitStruct.PLL3.PLLN = 225;
  RCC_OscInitStruct.PLL3.PLLFractional = 0;
  RCC_OscInitStruct.PLL3.PLLP1 = 2;
  RCC_OscInitStruct.PLL3.PLLP2 = 1;
  RCC_OscInitStruct.PLL4.PLLState = RCC_PLL_NONE;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_CPUCLK|RCC_CLOCKTYPE_HCLK
                              |RCC_CLOCKTYPE_SYSCLK|RCC_CLOCKTYPE_PCLK1
                              |RCC_CLOCKTYPE_PCLK2|RCC_CLOCKTYPE_PCLK5
                              |RCC_CLOCKTYPE_PCLK4;
  RCC_ClkInitStruct.CPUCLKSource = RCC_CPUCLKSOURCE_IC1;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_IC2_IC6_IC11;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV1;
  RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV1;
  RCC_ClkInitStruct.APB5CLKDivider = RCC_APB5_DIV1;
  RCC_ClkInitStruct.IC1Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
  RCC_ClkInitStruct.IC1Selection.ClockDivider = 3;
  RCC_ClkInitStruct.IC2Selection.ClockSelection = RCC_ICCLKSOURCE_PLL1;
  RCC_ClkInitStruct.IC2Selection.ClockDivider = 6;
  RCC_ClkInitStruct.IC6Selection.ClockSelection = RCC_ICCLKSOURCE_PLL2;
  RCC_ClkInitStruct.IC6Selection.ClockDivider = 1;
  RCC_ClkInitStruct.IC11Selection.ClockSelection = RCC_ICCLKSOURCE_PLL3;
  RCC_ClkInitStruct.IC11Selection.ClockDivider = 1;

